Repository: ahkcn/AutoHotkey-v2
Catalog: AutoHotkey-v2/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: ?All args are text by default.
zh_cn: 所有的参数默认为文本字符串。

source: ?Array.InsertAt(Index, Value1, ...): Insert one or more values at the given position.
zh_cn: ?Array.InsertAt(Index, Value1, ...)：在指定位置插入一个或多个值。

source: ?Built-in functions equivalent to each method also exist; e.g. ObjPop(Stack).
zh_cn: 仍存在等效于内置函数的方法；如，ObjPop(Stack)。

source: ?Count := Array.RemoveAt(Index, vCount): Remove all array elements from Index to Index+vCount-1.
zh_cn: Count := Array.RemoveAt(Index, vCount)：移除所有自索引（Index）至索引+vCount-1范围内的数组元素。

source: ?Count := Object.Remove(FirstKey, LastKey): Remove a range of keys and return the number of actual key-value pairs removed.
zh_cn: ?Count := Object.Remove(FirstKey, LastKey)：移除关于键的范围，返回实际移除的键值对的数量。

source: ?In place of the command name, write the target object and method name separated by a dot.
zh_cn: 命令名处，使用对象与句点连接的方法。

source: ?ObjRawSet(Object, Key, Value): Assigns a value to the object, bypassing any meta-functions.
zh_cn: ObjRawSet(Object, Key, Value)：赋值到对象，跳过任何元方法。

source: ?Stack.Push(Value1, ...): Insert one or more values at the end of the array.
zh_cn: Stack.Push(Value1, ...)：在数组末尾插入一个或多个值。

source: ?The return value is always discarded; there is no output variable.
zh_cn: 返回值被丢弃；没有输出变量。

source: ?Value := Array.RemoveAt(Index): Remove and return the array element at Index.
zh_cn: ?Value := Array.RemoveAt(Index)：移除并返回数组索引（Index）处的元素。

source: ?Value := Object.Remove(Key): Remove Key and return its prior value.
zh_cn: ?Value := Object.Remove(Key)：移除Key（键），返回他对应的值。

source: ?Value := Stack.Pop(): Remove and return the last array element.
zh_cn: Value := Stack.Pop()：移除并返回最后一个数组（栈）元素。

source: A for-loop can be used to find the lowest key.
zh_cn: 可用for-loop（循环）查找最小键。

source: A summary of changes will be posted here each time a new alpha is released.
zh_cn: 每次的变更记录会追加到本主题

source: Added capability to call methods with command syntax:
zh_cn: 支持使用命令语法调用方法：

source: Added support for binary zero in strings in expressions, and in objects.
zh_cn: 增加支持：表达式及对象中的字符串可包含二进制零。

source: Added support for comparing binary data using ==.
zh_cn: 增加支持：可使用==比较二进制数据。

source: Additionally x is y, where y is an object, checks if x derives from y, directly or indirectly.
zh_cn: 此外，对x is y，当y是对象时，检测x是否派生自y，不论直接或间接。

source: Affects the following: WinActive WinExist WinGetID WinGetIDLast WinGetList WinGetStyle WinGetStyleEx WinGetControlsHwnd ControlGet Hwnd Gui +HwndVarname GuiControlGet Hwnd Gui Add, ..., +HwndVarname MouseGetPos A_ScriptHwnd returns a string due to a technical limitation, but in decimal for consistency.
zh_cn: 涉及如下： WinActive WinExist WinGetID WinGetIDLast WinGetList WinGetStyle WinGetStyleEx WinGetControlsHwnd ControlGet Hwnd Gui +HwndVarname GuiControlGet Hwnd Gui Add, ..., +HwndVarname MouseGetPos 由于技术限制，A_ScriptHwnd仍返回字符串，考虑一致性，为十进制数值形式。

source: All WinSet' functions now return 1 on success, 0 on failure, while ErrorLevel is set to 0 on success, 1 on failure.
zh_cn: 所有的WinSet函数成功时返回1，失败时返回0，同时，ErrorLevel成功时为0，失败时为1。

source: All args are text by default.
zh_cn: 所有的参数默认为文本字符串。

source: All built-in methods of Objects and SafeArrays no longer support the _ (underscore) prefix, except _NewEnum, which now requires it (for compatibility with COM objects).
zh_cn: Objects（对象）与SafeArrays的内置方法不再支持_（下划线）前缀，除了_NewEnum（因为COM对象的兼容性需要）。

source: All other threads default to the last setting used by the auto-execute section, which itself defaults to no criterion (global hotkeys).
zh_cn: 其他线程默认为最近一次于自动执行段处的设置，默认为无限定条件（即全局热键）。

source: Array.InsertAt(Index, Value1, ...): Insert one or more values at the given position.
zh_cn: Array.InsertAt(Index, Value1, ...)：在指定位置插入一个或多个值。

source: Built-in functions equivalent to each method also exist; e.g. ObjPop(Stack).
zh_cn: 仍存在等效于内置函数的方法；如，ObjPop(Stack)。

source: Changed &(var:=1) to return var's 64-bit number buffer instead of its string buffer.
zh_cn: 改变，&(var:=1)返回变量的64位数值缓存，而非字符串缓存。

source: Changed ExitApp to pass ExitCode to the OnExit callback.
zh_cn: 更改ExitApp，可以传递退出代码（ExitCode）至OnExit回调。

source: Changed ExpandExpression() to free object references after completion.
zh_cn: 更改ExpandExpression()，使在（调用？）完成时释放对象引用。

source: Changed File commands to throw an error if given invalid parameters.
zh_cn: 更改File命令在无效参数时抛出错误。

source: Changed FileOpen() error handling for consistency with other commands.
zh_cn: 改变FileOpen()的错误处理方式至与其他命令一致。

source: Changed Func() to accept either a function name or a function reference.
zh_cn: 更改Func()使可接收函数名或函数引用。

source: Changed KeyWait to throw an error if KeyName is invalid.
zh_cn: 更改KeyWait，当KeyName无效时将抛出错误。

source: Changed OnClipboardChange() to affect script persistence.
zh_cn: 更改OnClipboardChange()可使脚本持续化。

source: Changed OnClipboardChange() to not immediately call the function.
zh_cn: 更改OnClipboardChange()，使其不立即调用函数。

source: Changed RegExMatch/RegExReplace to throw on PCRE execution errors.
zh_cn: 改变，RegExMatch / RegExReplace在PCRE执行错误时，抛出异常。

source: Changed StrSplit() to raise an error for invalid delimiters.
zh_cn: 更改StrSplit()在无效分隔符时抛出错误。

source: Changed VarSetCapacity to throw whenever capacity is invalid/too high.
zh_cn: 更改VarSetCapacity在容量无效/过大时抛出错误。

source: Changed commands/functions to return HWNDs and styles as pure integers.
zh_cn: 更改命令/函数返回纯整数的HWND及（或?）style。

source: Changed float format string for better accuracy and to avoid truncation.
zh_cn: 完善浮点数格式的字符串，提升精度并避免被截短。

source: Changed objects to treat numeric string keys as strings, not integers.
zh_cn: 改变，对象处理数值字符串为字符串，而非数值。

source: Changed regex option `a to enable \R to match Unicode newlines.
zh_cn: 改变正则选项`a，使\R可匹配Unicode新行符。

source: Changes from v1.1 to v2.0-a
zh_cn: V1.1自V2.0-a的变更文档

source: ComObject(pdsp), ComObject(9, pdsp) and ComObject(13, pdsp) no longer call AddRef by default; they default to "taking ownership" of the pointer.
zh_cn: ComObject(pdsp)、ComObject(9, pdsp)与ComObject(13, pdsp)默认不再调用AddRef；默认他们将作为指针的"持有者"。

source: Commands which set ErrorLevel now do so regardless of how they are called.
zh_cn: 不论命令以何种方式调用，命令均会设置ErrorLevel。

source: Commands() which returned ErrorLevel in previous v2 alphas now return !ErrorLevel (1 on success and 0 on failure), except for RunWait and SendMessage, which still return ErrorLevel.
zh_cn: 之前v2 alphas版本中Commands()返回ErrorLevel的情况，如今返回!ErrorLevel（1-成功，0-失败），除RunWait与SendMessage外，他们仍返回ErrorLevel。

source: Count (return value) includes only elements which actually existed within the array.
zh_cn: 返回值Count（数量）为数组中实际存在的元素。

source: Count := Array.RemoveAt(Index, vCount): Remove all array elements from Index to Index+vCount-1.
zh_cn: Count := Array.RemoveAt(Index, vCount)：移除所有自索引（Index）至索引+vCount-1范围内的数组元素。

source: Count := Object.Remove(FirstKey, LastKey): Remove a range of keys and return the number of actual key-value pairs removed.
zh_cn: Count := Object.Remove(FirstKey, LastKey)：移除关于键的范围，返回实际移除的键值对的数量。

source: Disallow methods with OnMessage to avoid confusion.
zh_cn: 禁止OnMessage中使用方法做消息响应函数，以避免混乱。

source: Fixed &byref_var_containing_int.
zh_cn: 修正&byref_var_containing_int（对包含数值的引用变量取地址）。

source: Fixed 'co', 'con', 'contain', etc. to not be reserved in expressions.
zh_cn: 修正'co'、'con'、'contain'等，不作为表达式的保留字。

source: Fixed ACT_FUNC/ACT_METHOD to support % v:=1 and % v:={} ByRef.
zh_cn: 修正ACT_FUNC/ACT_METHOD以支持% v:=1及% v:={}输入形式的引用。

source: Fixed Abs()/Mod() to not overwrite params which might be string/object.
zh_cn: 修正Abs()/Mod()不再覆盖（字符串/对象）参数。

source: Fixed JoyPOV to yield integer -1 when centered, not string.
zh_cn: 修复JoyPOV当居中时返回整数-1，而非字符串。

source: Fixed RegEx Callouts to be able to throw exceptions or to Exit the thread.
zh_cn: 修正RegEx调出，使其可以抛出异常或退出线程。

source: Fixed StrPut("", Encoding) - fixed by c3d844e, then broken by 855815e.
zh_cn: 修正StrPut("",Encoding)-修正于c3d844e，后于855815e被破坏。

source: Fixed X(,(y)) and X(,"%y%") incorrectly raising an error.
zh_cn: 修正X(,(y))与X(,"%y%")不正确地导致错误的问题。

source: Fixed a crash occurring when return "string" returns to CallFunc().
zh_cn: 修正返回"string"（字符串）至CallFunc()时导致崩溃的问题。

source: Fixed a memory leak occuring when RegExReplace throws an error.
zh_cn: 修正当RegExReplace抛出异常时的内存泄露。

source: Fixed command-style calls with no params to not require an output var.
zh_cn: 修正无参数的命令形式调用，不再需要输出参数。

source: Fixed commands which don't set ErrorLevel at all to not return 1.
zh_cn: 修正那些不涉及ErrorLevel的命令，不再返回1。

source: Fixed method-commands to invoke the default base object when appropriate.
zh_cn: 修正方法做命令调用，当需要时会触发默认基对象。

source: Fixed optimization to not make A_Index/A_EventInfo non-numeric.
zh_cn: 修正优化，不再致使A_Index/A_EventInfo变为非数值。

source: Fixed output vars of built-in functions to not require percent signs when called with command syntax.
zh_cn: 修复内嵌函数的输出变量，以便在命令调用方式中无需再为其添加百分号。

source: Fixed passing of objects and numbers to functions via command syntax.
zh_cn: 修正使用命令语法传递对象与数字到函数的错误。

source: Fixed plain text args of ACT_FUNC/ACT_METHOD (broken by 69e9675).
zh_cn: 修正ACT_FUNC/ACT_METHOD中的纯文本参数（于69e9675被损坏）。

source: Fixed return "just a string" to not literally include the quote marks.
zh_cn: 修正返回"带引号的字符串"的结果不包含引号的问题。

source: Fixed several uses of strings in objects (broken by 8cd2072).
zh_cn: 修正一些在对象中使用字符串的错误（于8cd2072破坏）。

source: Fixed simple % int args for ACT_METHOD.
zh_cn: 修正关于ACT_METHOD的简单% int（整数）参数。（？）

source: Fixed some object reference leaks.
zh_cn: 修正一些对象引用泄露。

source: Fixed throw str.
zh_cn: 修正throw str（抛出字符串）。

source: Fixed x.1 to call with an integer key, consistent with x.1().
zh_cn: 修正，将x.1作为关于数值键的调用，与x.1()一致。

source: Fixed x.y to call rather than get, consistent with x.y,.
zh_cn: 修正x.y作为调用，而非读，与x.y,一致。

source: Fixed x[1,2]+=y and %i-1%.
zh_cn: 修正x[1,2]+=y与%i-1%。

source: For information about AutoHotkey v2, click the link above.
zh_cn: 关于AHK V2，见链接。

source: For v2, the script must call ObjAddRef(pdsp) before ComObject(pdsp) if it does not "own" the reference (i.e. because the pointer will be released automatically, either when the wrapper object is released or immediately as a side-effect of querying for IDispatch within ComObject()).
zh_cn: V2中，若无别处"持有"关于pdsp的引用，则脚本须在ComObject(pdsp)前调用ObjAddRef(pdsp)（因为，当代理对象被释放时，或，作为ComObject()内部查询IDispatch时的副作用——即刻地，指针会被自动释放）。

source: Hotkey no longer defaults to the script's bottommost #If/#IfWin.
zh_cn: Hotkey所设置的热键不再默认视为如同存于脚本最底端#If/#IfWin之后。

source: Hotkey/hotstring threads default to the same criterion as the hotkey, so Hotkey, %A_ThisHotkey%, Off turns off the current hotkey even if it is context-sensitive.
zh_cn: 所设置的热键/热字串默认与当前热键的条件相同，故Hotkey, %A_ThisHotkey%, Off将关闭当前热键，即便它是上下文相关的。

source: Improved Click to support function syntax better - Click(x, y).
zh_cn: 增强Click，使支持函数语法 - Click(x, y)。

source: In particular:
zh_cn: 需强调：

source: In place of the command name, write the target object and method name separated by a dot.
zh_cn: 命令名处，使用对象与句点连接的方法。

source: Keywords contains and in are reserved for future use.
zh_cn: contains及in为脚本保留的关键词。

source: Major review of several areas of the code, with related bug-fixes, optimizations, and probably bugs.
zh_cn: 概要：涉及多个代码区域，Bug及潜在Bug修复、优化。

source: Merged v1.1.14.04.
zh_cn: 合并v1.1.14.04。

source: Merged v1.1.16.03 (plus a bug-fix).
zh_cn: 合并v1.1.16.03（及对错误的修复）。

source: Most v1 scripts which use ComObjEnwrap(pdsp) (within the first few pages of Google results) used it incorrectly; i.e. they did not release their own copy of the pointer.
zh_cn: 多数V1脚本中的ComObjEnwrap(pdsp)（摘自Google搜索中的前几页）是使用错误的；如，他们未释放自身对指针的引用副本。

source: New operator is replaces if var is type.
zh_cn: 操作符is替换掉if var is type。

source: ObjAddRef(addr := &object) can be used instead.
zh_cn: 使用ObjAddRef(addr := &object)代替。

source: ObjNewEnum(x) is still equivalent to x._NewEnum() for Objects.
zh_cn: ObjNewEnum(x)仍等效x._NewEnum()。

source: ObjRawSet(Object, Key, Value): Assigns a value to the object, bypassing any meta-functions.
zh_cn: ObjRawSet(Object, Key, Value)：赋值到对象，跳过任何元方法。

source: Object.MaxIndex() has been changed to Object.Length() (or Object.Length) and now returns 0 if there are no integer keys, to make it easier to use.
zh_cn: Object.MaxIndex()变为Object.Length()（或Object.Length），当无整数键时返回0。

source: Object.MinIndex() has been removed, since it was the rarely used counterpart of MaxIndex.
zh_cn: 移除Object.MinIndex()，较MaxIndex其极少使用。

source: Optimized returning dynamically-allocated values from functions.
zh_cn: 优化函数返回的动态分配的值。

source: Parameter count validation and out-of-memory handling in Object methods has been brought in line with the majority of built-in functions.
zh_cn: 对象方法中的参数数量检测及内存耗尽响应按照其他函数那样处理。（将在运行时提示错误）

source: Removed "polymorphic" behaviour of ComObj...().
zh_cn: 移除ComObj...()的"多态"行为。

source: Removed ACT_GETKEYSTATE, reducing code size and fixing "GetKeyState Joy%btn%" to return 0/1 instead of U/D.
zh_cn: 移除ACT_GETKEYSTATE，减小代码大小，并修复"GetKeyState Joy%btn%"以返回0/1而非U/D。

source: Removed ComObjMissing().
zh_cn: 移除ComObjMissing()。

source: Removed ComObjUnwrap(obj) and ComObjTypo(obj,...).
zh_cn: 移除ComObjUnwrap(obj)与ComObjTypo(obj,...)。

source: Removed object -> address mode of Object().
zh_cn: 移除Object()的对象->地址模式。

source: Renamed Args to A_Args and changed behaviour slightly.
zh_cn: 重命名Args为A_Args，并略微改变其行为。

source: Restored the #Persistent directive.
zh_cn: 恢复#Persistent指令。

source: Revised GetKeyState and KeyWait.
zh_cn: 修正GetKeyState及KeyWait。

source: See Command() in v2-changes for an overview of how this works.
zh_cn: 见V2变更文档中Command()部分。

source: See Error Handling in v2-changes.
zh_cn: V2变更文档中Error Handing（错误处理），

source: Side note: standalone "x.y" expressions were originally disallowed.
zh_cn: 旁注：原本就禁止单独的x.y表达式。

source: Since type is a string, it must be enclosed in quote marks (or a variable) - for example, n is 'number'.
zh_cn: type（类型）的值是字符串，故需置于引号中（或变量中）—如，n is 'number'。

source: Split ComObjActive() from ComObject() and changed "ownership" rules - see below.
zh_cn: 从ComObject()中移出ComObjActive()，并改变"持有者关系" - 见后。

source: Stack.Push(Value1, ...): Insert one or more values at the end of the array.
zh_cn: Stack.Push(Value1, ...)：在数组末尾插入一个或多个值。

source: The flags parameter now only affects SafeArrays.
zh_cn: flags参数当前仅影响SafeArrays。

source: The return value is always discarded; there is no output variable.
zh_cn: 返回值被丢弃；没有输出变量。

source: The same type names are supported as before, plus object and byref.
zh_cn: 支持的类型名称新增object、byref。

source: This was changed to allow lazy VB converts to use code like "App.Quit", which should still work, but will now also work with AHK Objects.
zh_cn: 此项更改用于支持惰性VB转换，以便使用类似App.Quit形式的代码，其应该仍可以工作，且当前支持对象了。

source: To remove common points of confusion related to the dual nature of Objects (as associative arrays which can be used like linear arrays), the methods Insert and Remove have been split into the following (where Object, Array and Stack are all simply objects):
zh_cn: 为了解决关于对象双重性的混乱（如，关联数组可作线性数组使用），方法Insert与Remove拆分如下（其中Object、Array及Stack均为对象）：

source: To write a standalone ternary, post-increment or post-decrement expression, either omit the space between the variable and the operator, or wrap the variable or expression in parentheses.
zh_cn: 要使用三元操作符或后置自增操作符或后置自减操作符，可移除变量与操作符间的空格，或，使用圆括号包裹变量。

source: Unlike v1, does not affect any of the remaining keys.
zh_cn: 与v1不同，不影响其他键。

source: Value := Array.RemoveAt(Index): Remove and return the array element at Index.
zh_cn: Value := Array.RemoveAt(Index)：移除并返回数组索引（Index）处的元素。

source: Value := Object.Remove(Key): Remove Key and return its prior value.
zh_cn: Value := Object.Remove(Key)：移除Key（键），返回他对应的值。

source: Value := Stack.Pop(): Remove and return the last array element.
zh_cn: Value := Stack.Pop()：移除并返回最后一个数组（栈）元素。

source: Var.Method and Var.Property.Method are both acceptable, but anything more complex (such as Var[x].Method or %Var%.Method) is not supported.
zh_cn: Var.Method即Var.Property.Method均可，但更复杂的情况（如 Var[x].Method或%Var%.Method）不可。

source: Write two consecutive commas instead: x.y(a, , c) or p := [a, , c], x.y(p*).
zh_cn: 使用两个连续逗号取代，如x.y(a, , c)或p := [a, , c], x.y(p*)。

source: [fincs] Changed OnExit to accept a function.
zh_cn: [fincs]更改OnExit使可接收函数参数。

source: [fincs] Removed OnClipboardChange and added a function like OnExit.
zh_cn: [fincs]移除OnClipboardChange，增加类似于OnExit的函数。

source: en-gb
zh_cn: en-2gb

source: word ? x : y, word ++ and word -- are no longer expressions, since word can be a user-defined command.
zh_cn: word ? x : y、word ++与word --不再是表达式，因为word可能为用户定义的命令。

source: •DllCall and RegExMatch/Replace always throw exceptions instead of using ErrorLevel.
zh_cn: DllCall与RegExMatch/Replace使用异常取代ErrorLevel。

source: •Exceptions are thrown for more failure conditions within expression evaluation and object usage.
zh_cn: 表达式求值与对象使用中包含更多可能触发异常的条件检查。

source: •If no args, assign an empty array so A_Args[1] doesn't cause an error.
zh_cn: 如果脚本无参数，则赋值空数组，进而A_Args[1]不会致使错误。

source: •Made it super-global so behaviour is like other built-in vars.
zh_cn: 作为超级全局变量，如同其他内置变量。

source: •OnMessage throws on failure and returns an empty string if there was no previous function.
zh_cn: OnMessage失败时抛出异常；若无消息处理函数，返回空字符串。

source: •Wrapping commands in a try block no longer causes them to throw exceptions.
zh_cn: 在try块内使用命令，不再致使异常。
